#+TITLE: Autotuning under Tight Budget Constraints:
#+TITLE: @@latex: \\[0.3em]@@ A Transparent Design of Experiments Approach
#+AUTHOR:    Pedro Bruel - phrb@ime.usp.br
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  en
#+OPTIONS:   H:1 num:t toc:nil @:t \n:nil ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   tex:t latex:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:
#+LINK_HOME:
#+COLUMNS: %40ITEM %10BEAMER_env(Env) %9BEAMER_envargs(Env Args) %4BEAMER_col(Col) %10BEAMER_extra(Extra)

#+STARTUP: beamer
#+LATEX_CLASS: beamer
#+LATEX_CLASS_OPTIONS: [11pt, compress, aspectratio=169, xcolor={table,usenames,dvipsnames}]

#+LATEX_HEADER: \renewcommand\maketitle{}
#+LATEX_HEADER: \input{configuration}

#+LATEX_HEADER: \pgfdeclareimage[height=\paperheight,width=\paperwidth]{overlay_image}{../../../img/polaris.pdf}
#+LATEX_HEADER: \usebackgroundtemplate{\tikz\node[inner sep=0] {\pgfuseimage{overlay_image}};}

**** Loading Data
     #+HEADER: :results output :session *R* :eval no-export
     #+BEGIN_SRC R
     library(ggplot2)
     library(plyr)
     library(dplyr)
     library(reshape2)
     library(openssl)
     library(RColorBrewer)
     library(extrafont)

     data_dir <- "dlmt_spapt_experiments/data/results"
     target_dirs <- list.dirs(path = data_dir, full.names = FALSE, recursive = FALSE)
     data <- NULL

     read.csv.iterations.cost <- function(csv_file) {
         data <- read.csv(csv_file, header = TRUE)

         data$experiment_id <- rep(sha1(csv_file), nrow(data))
         data_baseline <- data[data$baseline == "True", "cost_mean"]
         data$cost_baseline <- rep(data_baseline, nrow(data))
         data$speedup <- data_baseline / data$cost_mean
         data$max_run_speedup <- rep(max(data$speedup), nrow(data))
         data$min_run_cost <- rep(min(data$cost_mean), nrow(data))

         data <- data[data$baseline == "False", ]
         data <- data[data$correct_result == "True", ]

         data$best_iteration <- rep(as.numeric(rownames(data[data$speedup == max(data$speedup), ])), nrow(data))
         data$points <- rep(nrow(data), nrow(data))

         return(data)
     }

     for (target_dir in target_dirs) {
         target_path <- paste(data_dir, "/", target_dir, "/", sep = "")

         csv_files <- list.files(path = target_path, pattern = "search_space.csv", recursive = TRUE)
         if (length(csv_files) != 0) {
             csv_files <- paste0(target_path, csv_files)

             info <- file.info(csv_files)
             non_empty <- rownames(info[info$size != 0, ])
             csv_files <- csv_files[csv_files %in% non_empty]
             target_data <- lapply(csv_files, read.csv.iterations.cost)
             target_data <- bind_rows(target_data)
             target_data <- target_data[, c("cost_mean", "experiment_id", "technique", "cost_baseline", "min_run_cost", "best_iteration")]
             target_data$application <- rep(target_dir, nrow(target_data))

             if (is.null(data)) {
                 data <- target_data
             } else {
                 data <- bind_rows(data, target_data)
             }
         }
     }

     plot_data <- data %>%
                  distinct(experiment_id, .keep_all = TRUE) %>%
                  group_by(application) %>%
                  mutate(mean_cost_baseline = mean(cost_baseline)) %>%
                  ungroup()

     plot_data <- plot_data %>%
                  distinct(experiment_id, .keep_all = TRUE) %>%
                  group_by(application, technique) %>%
                  mutate(label_center_x = mean(cost_mean)) %>%
                  mutate(label_center_y = mean(best_iteration)) %>%
                  ungroup()

     complete_plot_data <- plot_data
     #+END_SRC

     #+RESULTS:
     #+begin_example

     Attaching package: ‘dplyr’

     The following objects are masked from ‘package:plyr’:

         arrange, count, desc, failwith, id, mutate, rename, summarise,
         summarize

     The following objects are masked from ‘package:stats’:

         filter, lag

     The following objects are masked from ‘package:base’:

         intersect, setdiff, setequal, union

     Registering fonts with R

     There were 50 or more warnings (use warnings() to see the first 50)
     #+end_example
